# 목표

KMRD 데이터 확인 및 기본 통계 분석

In [19]:
import pandas as pd
casting = pd.read_csv('./kmrd/kmr_dataset/datafile/kmrd-small/castings.csv')
countries = pd.read_csv('./kmrd/kmr_dataset/datafile/kmrd-small/countries.csv')
genres = pd.read_csv('./kmrd/kmr_dataset/datafile/kmrd-small/genres.csv')
rates = pd.read_csv('./kmrd/kmr_dataset/datafile/kmrd-small/rates.csv')

In [20]:
casting.head()

   movie  people  order  leading
0  10001    4374      1        1
1  10001     178      2        1
2  10001    3241      3        1
3  10001   47952      4        1
4  10001   47953      5        0

In [21]:
countries.head()

   movie country
0  10001    이탈리아
1  10001     프랑스
2  10002      미국
3  10003      미국
4  10004      미국

In [22]:
genres.head()

   movie   genre
0  10001     드라마
1  10001  멜로/로맨스
2  10002      SF
3  10002     코미디
4  10003      SF

In [23]:
rates.head()

   user  movie  rate        time
0     0  10003     7  1494128040
1     0  10004     7  1467529800
2     0  10018     9  1513344120
3     0  10021     9  1424497980
4     0  10022     7  1427627340

In [ ]:
# 기본 통계 분석